dmatking/m5stack-tab5-gps/sdkconfig.defaults
# Target: ESP32-P4 v1.x (Tab5 ships with v1.3)
# SELECTS_REV_LESS_V3 is required — REV_MIN_* options depend on it
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Lets flash erase/program ops suspend when the CPU needs the bus instead of
# blocking interrupts for the whole operation -- prevents the MIPI-DSI frame
# DMA from missing its per-frame re-arm and underrunning (blue/cyan flash).
# See m5stack-tab5-ssh-terminal's OTA work for the original diagnosis.
CONFIG_SPI_FLASH_AUTO_SUSPEND=y

# Custom partition table -- dual-OTA-slot layout (ota_0/ota_1), see
# partitions.csv
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# CPU (360 MHz)
CONFIG_ESP_DEFAULT_CPU_FREQ_360=y
CONFIG_FREERTOS_HZ=1000

# Console — UART primary, USB JTAG secondary
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# TinyUSB mass-storage (main/usb_msc.c) -- exposes the microSD card as a
# USB drive over the USB-A/OTG port, gated at runtime behind USB_MSC_MODE
# (see main.cmake.extra); the driver itself must still be enabled here to
# compile in either build.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_FATFS_LFN_HEAP=y

# PSRAM (HEX mode, 200 MHz)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# LVGL (main/ui_shell.c + main/design_ui.c and friends -- splash + the
# real Home/Map screens, map screen itself stays native). Same base
# settings verified working on this board/panel in m5stack-tab5-lvgl-primer.
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
# Montserrat sizes the design UI's fallback theme falls back to when
# UI_USE_CUSTOM_FONTS=0 (see ui_theme.c) -- 20/24/28/32/40 for that, 48
# also used directly by ui_shell.c's own splash screen text.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
# CONFIG_LV_BUILD_EXAMPLES is not set
# CONFIG_LV_BUILD_DEMOS is not set

# main/mockup_viewer.c (now orphaned/unreferenced, see ui_shell.c's header
# comment): full-screen mockup images read straight off the SD card as raw
# RGB565 -- LVGL's PNG decoder path was tried first and abandoned after
# real memory problems on real hardware. No PNG decoder or LVGL filesystem
# driver needed as a result -- the app reads the files itself via plain
# fopen()/fread() and hands LVGL an LV_IMAGE_SRC_VARIABLE.

# Surfaces LVGL's own internal errors (failed fs_open/decode, etc.) on the
# console instead of failing completely silently -- was off by default,
# which is why the mockup PNGs not loading produced zero diagnostic output
# the first time this was needed.
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y

# LVGL's default allocator (LV_USE_BUILTIN_MALLOC) is its own tiny internal
# pool, LV_MEM_SIZE_KILOBYTES=64 by default -- totally separate from
# ESP-IDF's heap/PSRAM. A 720x1280 PNG decodes to ~3.6MB (LodePNG always
# decodes to ARGB8888); confirmed on real hardware that this fails with
# "error 83: memory allocation failed" against a 64KB pool, no matter how
# much real PSRAM is free. CLIB_MALLOC routes lv_malloc() through plain
# malloc()/free(), which -- thanks to CONFIG_SPIRAM_USE_MALLOC above --
# transparently spills anything past CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL
# into PSRAM, same as any other large ESP-IDF allocation in this project.
CONFIG_LV_USE_CLIB_MALLOC=y

# LV_USE_FLOAT was off by default (it only gates lv_value_precise_t's
# internal representation, not anything this app touches directly) -- but
# it ALSO controls whether LVGL's own builtin sprintf (lv_sprintf_builtin.c,
# CONFIG_LV_USE_BUILTIN_SPRINTF above) compiles in its "%f" case at all:
# PRINTF_DISABLE_SUPPORT_FLOAT is literally #defined as (!LV_USE_FLOAT).
# With it off, "%f"/"%.Nf" in any lv_label_set_text_fmt() call fell through
# with NO case at all -- confirmed on real hardware that this doesn't
# crash, it just emits the literal trailing 'f' character and, critically,
# never consumes the float argument from the va_list, silently misaligning
# every argument after it in the same call. This is the real root cause
# behind two things found the hard way this project: labels showing a bare
# "f" instead of a number (HDOP/trip/accuracy on the Telemetry screen), and
# an earlier hardware-confirmed crash in ui_nav.c/ui_map.c where a %f
# was followed by a %s in the same call (the %s read the wrong, misaligned
# va_arg slot -- a garbage pointer, not just a garbage number). Those two
# call sites already work around it by formatting the float into its own
# buffer first, and are left that way (harmless, no reason to unwind), but
# this is the actual fix -- every OTHER %f call across the UI needed it too.
CONFIG_LV_USE_FLOAT=y

# Used once, at boot, to render the real ui_common.c navbar off-screen and
# capture its pixels (main/navbar_snapshot.c) -- the Map screen then just
# blits that captured bitmap instead of re-implementing font/icon
# rendering natively. A from-scratch attempt at the latter (calling
# LVGL's own glyph-bitmap API directly from the native, LVGL-stopped
# render path) shipped once, crashed on real hardware, and was reverted --
# lv_snapshot_take() runs through LVGL's normal, already-proven render
# pipeline while LVGL is still fully up, which is a lot less to get wrong
# than reaching into font internals from outside it.
CONFIG_LV_USE_SNAPSHOT=y

# WiFi -- Tab5 has no native WiFi; the P4 talks to an onboard ESP32-C6
# co-processor over SDIO via esp_hosted + esp_wifi_remote (weak-symbol shim
# that redirects standard esp_wifi_* calls to the hosted co-processor). Pin
# set below is TAB5-SPECIFIC -- the generic esp_hosted defaults target a
# different reference board's SDIO pins and silently fail (handshake
# timeout) on this board. Confirmed identical across m5stack-tab5-ssh-terminal,
# m5stack-tab5-video-stream, and esp32-p4-webradio's own sdkconfig.tab5; the
# PRIV_*_SLOT_1 keys specifically (not the plain/non-slot keys, which get
# reset to slot defaults at config-gen) are what's required.
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=13
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=12
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=11
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=10
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=9
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=8
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
